#define _CRT_SECURE_NO_WARNINGS 1

#include <stdio.h>

//   //(*pa) == ([] * pa) 表示pa 存数组地址的变量
// 
//   //int arr[10] = { 1, 2, 3, 4, 5, 6, 7, 8, 9, 10 };
// 
//   //int (*pa)[10] = &arr;//arr 整个数组的地址  
// 
//   //此处个人理解(*pa) == (int* pa) or ==([ ]* pa)
// 
//   //(*pa) == ( int* or char* or ...*   pa )  
// 
//   //*只是表示pa 是个存地址的变量

//int main()
//{
//	int a = 0x11223344;
//	//int* p = &a;
//	//*p = 0;
//	char* p = &a;
//	*p = 0;
//	return 0;
//}
//int main()
//{
//	char a = -128;
//	printf("%u\n", a);
//	return 0;
//}

//int main()
//{
//	char a = -128;
//	//10000000000000000000000010000000
//	//11111111111111111111111101111111
//	//11111111111111111111111110000000-补码
//	//10000000
//	//11111111111111111111111110000000-补码
//	//
//	printf("%u\n", a);
//
//	//%d - 打印十进制的有符号数字
//	//%u - 打印十进制的无符号数字
//
//	return 0;
//}
    //char 最多存 -2^7 --2^7 -1  -128 -- 127
    //10000000  —— 01111111  类似钟表12过后是1点了
//#include <stdio.h>
//int main()
//{
//	char a = 128;   // 128-2^8=-128  组成求补运算
//	//10000000000000000000000010000000
//	//11111111111111111111111101111111
//	//11111111111111111111111110000000-补码
//	//10000000
//	//11111111111111111111111110000000-补码
//	//
//	printf("%u\n", a);
//
//	//%d - 打印十进制的有符号数字
//	//%u - 打印十进制的无符号数字
//
//	return 0;
//}

//9.0
//1001.0
//(-1)^0 * 1.001 * 2^3
//(-1)^s * M     * 2^E
//s - 0
//M - 1.001
//E - 3
//
//0.5
//0.1
//(-1)^0 * 1.0 * 2^-1
//S = 0
//M = 1.0
//E = -1
//E + 127 = 126
//
//int main()
//{
//	int n = 9;
//	//0 00000000 00000000000000000001001-补码
//	//
//	float *pFloat = (float *)&n;
//	printf("n的值为：%d\n", n);//9
//	printf("*pFloat的值为：%f\n", *pFloat);//0.000000
//	//(-1)^0 * 0.00000000000000000001001 * 2^-126
//	//
//	*pFloat = 9.0;
//	//1001.0
//	//1.001*2^3
//	//(-1)^0 *1.001 * 2^3
//	//01000001000100000000000000000000
//
//	printf("num的值为：%d\n", n);
//	printf("*pFloat的值为：%f\n", *pFloat);//9.0
//	return 0;
//}
//
//int main()
//{
//	float f = 5.5;
//	//5.5
//	//101.1
//	//(-1)^0 * 1.011*2^2
//	//S = 0
//	//M = 1.011 
//	//E = 2
//	//0 10000001 01100000000000000000000
//	//0x40b00000
//	//(-1)^0 * 1.011 * 2^2
//	//
//
//	//0 00000000 01100000000000000000000
//	//+/- 0.011 * 2^-126
//	//接近于0的数字
//	//0 11111111 01100000000000000000000
//	//E+127 = 255
//	//E = 128
//	//1.xxx * 2^128
//	//表示的正负无穷大的数字
//	//
//	return 0;
//}

//int main()
//{
//	const char* p = "abcdef";//存储首字符地址 
//"abcdef" 是一个常量字符串 
//	//*p = 'W';
//	printf("%s\n", p);
//
//	//printf("%c\n", *p);
//	//printf("%s\n", p);
//
//	return 0;
//}

//int main()
//{
//    int arr1[] = { 1,2,3,4,5 };
//    int arr2[] = { 1,2,3,4,5 };
//    int arr3[] = { 1,2,3,4,5 };
//    int* parr[] = { arr1,arr2,arr3 };
//    int i = 0;
//    for (i = 0; i < 3; i++)
//    {
//        int j = 0;
//        for (j = 0; j < 5; j++)
//        {
//            printf("%d ", *(parr[i] + j));
//        }
//        printf("\n");
//    }
//    return 0;
//}

//int main()
//{
//	char* arr[5];
//	char* (*pa)[5] = &arr;//
//
//	int arr2[10] = { 0 };
//	int (*pa2)[10] = &arr2;
//	return 0;
//}

//int main()
//{
//	//int *p = NULL; //p是整形指针 - 指向整形的指针 - 可以存放整形的地址
//	//char* pc = NULL;//pc是字符指针 - 指向字符的指针 - 可以存放字符的地址
//	               //数组指针 - 指向数组的指针 - 存放数组的地址
//	//int arr[10] = {0};
//	//arr- 首元素地址
//	//&arr[0] -首元素的地址
//	//&arr - 数组的地址
//
//	int arr[10] = { 1, 2, 3, 4, 5, 6, 7, 8, 9, 10 };
//	int (*p)[10] = &arr;//数组的地址要存起来
//	//上面的p就是数组指针
//
//	return 0;
//}

//int main() 数组地址存放数组指针 变量pa 中
//{
//	int arr[10] = { 1, 2, 3, 4, 5, 6, 7, 8, 9, 10 };
//	int *p = arr;
//	int i = 0;
//	for (i = 0; i < 10; i++)
//	{
//		printf("%d ", *(p + i));
//	}
//   //数组地址存放数组指针 变量pa 中
//   //(*pa)表示变量pa是一个地址 地址是数组int [10]的地址
//	//int (*pa)[10] = &arr;//arr 整个数组的地址
//	//int i = 0;
//	//for (i = 0; i < 10; i++)
//	//{
//	//	printf("%d ", *(*pa + i));//*pa == arr
//	//}//(*pa) de *只是表示 pa是存地址的变量（指针）
//     //是个特例
//	/*for (i = 0; i < 10; i++)
//	{
//		printf("%d ", (*pa)[i]);
//	}
//	*/
//	return 0;
//}

